Revit 2027 API
EndTreatmentType.EndTreatment Property
 String describing the end treatment
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string EndTreatment { get; set; }
Public Property EndTreatment As String
	Get
	Set
public:
property String^ EndTreatment {
	String^ get ();
	void set (String^ value);
}
member EndTreatment : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
EndTreatmentType Class
Autodesk.Revit.DB.Structure Namespace